app/controllers/image_comments_controller.rb

	def create
	  @image_comment = ImageComment.create(image_comment_params)
	  @image_comment.user_id = current_user.id
	  @image_comment.image_id = params[:image_id]

	  if @image_comment.save
---
INSERT INTO "image_comments" ("body", "rating", "user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "gjghj"], ["rating", 3], ["user_id", 1], ["image_id", 28], ["created_at", 2017-04-01 11:47:36 UTC], ["updated_at", 2017-04-01 11:47:36 UTC]]
UPDATE "image_comments" SET "user_id" = ?, "image_id" = ?, "updated_at" = ? WHERE "image_comments"."id" = ?  [["user_id", 1], ["image_id", 25], ["updated_at", 2017-04-01 08:42:16 UTC], ["id", 5]]