app/controllers/images_controller.rb

	def index
		@images = Image.page(params[:page]).per(12).order('id DESC')
---
SELECT "images".* FROM "images" ORDER BY id DESC
SELECT COUNT(*) FROM "images"

	def create
		@image = current_user.images.create(image_params)
---
INSERT INTO "images" ("user_id", "title", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["user_id", 7], ["title", "asdasd"], ["created_at", 2017-04-01 07:36:58 UTC], ["updated_at", 2017-04-01 07:36:58 UTC], ["picture", "maxresdefault.jpg"]]

	def show
		@image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]

	def destroy
		@image = Image.find(params[:id])
		@image.destroy if @image.user == current_user
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 26]]