app/views/images/show.html.erb

				<div class="page-header">
					<h1><small class="pull-right"><%= @image.image_comments.count %></small> Comments </h1>
---
SELECT "image_comments".* FROM "image_comments" WHERE "image_comments"."image_id" = ?  [["image_id", 25]]
SELECT COUNT(*) FROM "image_comments" WHERE "image_comments"."image_id" = ?  [["image_id", 20]]